export const languages = {
  he: {
    translation: {
      header: {
        logo: 'לוֹגוֹ',
        menu: 'תפריט',
        basic: 'בית',
        aboutUs: 'אודותינו',
        services: 'שירותים',
        helpCustomers: 'עזרה ללקוחות',
        ourTeam: 'הצוות שלנו',
        blog: 'בלוג',
        contacts: 'יצירת קשר',
        carInsurance: 'ביטוח רכב',
        mortgageInsurance: 'ביטוח משכנתא',
        travelInsurance: 'ביטוח נסיעות',
        healthInsurance: 'ביטוח בריאות',
        lifeInsurance: 'ביטוח חיים',
        businessInsurance: 'ביטוח עסקי',
        internationalTravelInsurance: 'ביטוח נסיעות לחו"ל',
        accidentInsurance: 'ביטוח תאונות',
        propertyInsurance: 'ביטוח רכוש',
        financialPlanningAndLoans: 'תכנון פיננסי והלוואות',
        pensionAssetManagement: 'ניהול נכסי פנסיה',
        investmentFunds: 'קרנות השקעה',
        rightsRealization: 'מימוש זכויות',
        AnatolyMiller: 'אנטולי מילר',
        KristinaMiller: 'קריסטינה מילר',
        Permyakov: 'סטניסלב פרמיאקוב',
        Plugin: 'ולדיסלב פלוגין',
        Povolotsky: 'מיכאיל פובולוצקי',
        Pinkasovich: 'מיכאיל פינקסוביץ',
      },

      accessibility: {
        accessibility__title: 'פאנל נגישות',
        accessibility__button1: 'כיבוי מצב מונוכרום',
        accessibility__button2: 'הפעלת מצב מונוכרום',
        accessibility__button3: 'כיבוי ניגודיות כהה',
        accessibility__button4: 'הפעלת ניגודיות כהה',
        accessibility__button5: 'כיבוי ניגודיות בהירה',
        accessibility__button6: 'הפעלת ניגודיות בהירה',
        accessibility__button7: 'הגדלת גופן',
        accessibility__button8: 'הקטנת גופן',
      },

      home: {
        heroSection: {
          heroSection__title: 'סוכנות הביטוח מילר',
          heroSection__text: 'השותף האמין שלך בתחום הביטוח והפיננסים עם ניסיון של למעלה מ-20 שנה',
          heroSection__button: 'לשאול שאלה',
        },

        services: {
          "services__title": "השירותים המרכזיים שלנו:",
          "services__name1": "ביטוח מכל הסוגים",
          "services__text1": "אנו מציעים כיסוי ביטוחי מלא ללקוחות פרטיים ועסקיים, כולל ביטוח רכב, דירה, בריאות, חיים ועסקים. הצוות שלנו כאן כדי לעזור לך לבחור את הפוליסה המתאימה ביותר, כך שתוכל להיות רגוע ובטוח.",
          "services__link": "לפרטים נוספים",
          "services__name2": "תכנון פיננסי והלוואות",
          "services__text2": "השירותים הפיננסיים שלנו נועדו לעזור לך להגשים את המטרות הכלכליות שלך. אנו נתכנן עבורך תוכנית מותאמת אישית ונמצא פתרונות אשראי מתאימים, בין אם מדובר ברכישת דירה או בפיתוח עסקי.",
          "services__name3": "ניהול נכסים פנסיוניים",
          "services__text3": "אנו מתמחים בניהול חסכונות פנסיוניים, תוך בחירת כלי השקעה נכונים שיבטיחו לך הכנסה יציבה בעת הפרישה. המטרה שלנו היא למקסם את החיסכון שלך ולהעניק לך ביטחון כלכלי לטווח ארוך.",
          "services__name4": "קרנות השקעה",
          "services__text4": "אנו מציעים גישה לקרנות השקעה מגוונות שיסייעו לך לפזר סיכונים ולמקסם את הצמיחה של ההון שלך. צוות המומחים שלנו יסייע לך לבחור את הקרנות המתאימות ביותר לצרכים ולרמת הסיכון שלך.",
          "services__name5": "מימוש זכויות פיננסיות",
          "services__text5": "אנו מספקים סיוע מלא למימוש הזכויות שלך בתחומי הביטוח והפיננסים. הצוות שלנו כאן כדי ללוות אותך בכל שלב, לוודא שתקבל את כל ההטבות המגיעות לך ולהגן על האינטרסים שלך.",
          "services__name6": "סיוע בתביעות ביטוח",
          "services__text6": "אנו מציעים ליווי מלא בתהליך הגשת תביעת ביטוח, החל מהכנת המסמכים ועד ההתנהלות מול חברות הביטוח. המטרה שלנו היא להקל עליך ולוודא שתקבל את כל הפיצויים שמגיעים לך."
        },

        advantages: {
          advantages__title: "היתרונות שלנו:",
          advantages__name1: "יחס אישי לכל לקוח",
          advantages__text1: "אנו מאמינים שכל אדם ועסק הם ייחודיים, ולכן אנו מתאימים לכל לקוח פתרונות אישיים בהתאם לצרכיו ולמטרותיו. צוות המומחים שלנו בונה אסטרטגיה מותאמת אישית כדי להבטיח לכם הגנה אופטימלית ושקט נפשי.",
          advantages__name2: "מקצועיות ואמינות",
          advantages__text2: "עם ניסיון עשיר וצוות מומחים שעובר הכשרות מתמשכות, אנו מתחייבים לרמה הגבוהה ביותר של שירות. אנו משלבים כלים חדשניים ושיטות מתקדמות להערכת סיכונים, במטרה להעניק לכם ביטחון מלא ושירות ברמה הגבוהה ביותר.",
          advantages__name3: "שקיפות ותהליך מהיר ויעיל",
          advantages__text3: "אנו פועלים בשקיפות מלאה ודואגים שתהיו מעודכנים בכל שלב בתהליך. המדיניות שלנו מבוססת על מתן שירות הוגן ומהיר, על מנת להבטיח לכם תהליך קל, ללא עיכובים וללא דאגות מיותרות."
        }
      },
    }
  },

  ru: {
    translation: {
      header: {
        logo: 'Лого',
        menu: 'Меню',
        basic: 'Главная',
        aboutUs: 'О нас',
        services: 'Услуги',
        helpCustomers: 'Помощь клиентам',
        ourTeam: 'Наша команда',
        blog: 'Блог',
        contacts: 'Контакты',
        carInsurance: 'Страхование автомобилей',
        mortgageInsurance: 'Страхование ипотеки',
        travelInsurance: 'Туристическое страхование',
        healthInsurance: 'Страхование здоровья',
        lifeInsurance: 'Страхование жизни',
        businessInsurance: 'Страхование бизнеса',
        internationalTravelInsurance: 'Страхование путешествий за границу',
        accidentInsurance: 'Страхование от несчастных случаев',
        propertyInsurance: 'Страхование имущества',
        financialPlanningAndLoans: 'Финансовое планирование и ссуды',
        pensionAssetManagement: 'Ведение пенсионных активов',
        investmentFunds: 'Инвестиционные фонды',
        rightsRealization: 'Реализация прав',
        AnatolyMiller: 'Анатолий Миллер',
        KristinaMiller: 'Кристина Миллер',
        Permyakov: 'Станислав Пермяков',
        Plugin: 'Владислав Плюгин',
        Povolotsky: 'Михаил Поволоцкий',
        Pinkasovich: 'Михаил Пинкасович',
      },

      accessibility: {
        accessibility__title: 'Панель доступности',
        accessibility__button1: 'Отключить монохромный режим',
        accessibility__button2: 'Включить монохромный режим',
        accessibility__button3: 'Отключить темный контраст',
        accessibility__button4: 'Включить темный контраст',
        accessibility__button5: 'Отключить светлый контраст',
        accessibility__button6: 'Включить светлый контраст',
        accessibility__button7: 'Увеличить шрифт',
        accessibility__button8: 'Уменьшить шрифт',
      },

      home: {
        heroSection: {
          heroSection__title: 'Страховое агенство Миллер',
          heroSection__text: 'Ваш надежный партнер в мире финансов и страхования с более чем 20-летним опытом',
          heroSection__button: 'Задать вопрос',
        },

        services: {
          services__title: 'Наши основные услуги:',
          services__name1: 'Страхование всех <br />видов',
          services__text1: 'Мы предлагаем полное страховое покрытие для физических и юридических лиц, включая автомобили, имущество, здоровье, жизнь и бизнес. Наша команда поможет вам выбрать оптимальный полис, обеспечивая уверенность и защиту ваших интересов',
          services__link: 'Узнать больше',
          services__name2: 'Финансовое планирование и ссуды',
          services__text2: 'Наши услуги финансового планирования помогут вам достичь финансовых целей. Мы разработаем персонализированный план и предложим подходящие кредитные решения для осуществления ваших мечт, будь то покупка жилья или финансирование бизнеса',
          services__name3: 'Ведение пенсионных активов',
          services__text3: 'Мы помогаем оптимизировать пенсионные сбережения, выбирая правильные инвестиционные инструменты для стабильного дохода на пенсии. Наша цель — максимизировать ваши накопления и обеспечить финансовую независимость в будущем',
          services__name4: 'Инвестиционные <br />фонды',
          services__text4: 'Предлагаем доступ к различным инвестиционным фондам для диверсификации ваших инвестиций и увеличения капитала. Наши эксперты помогут подобрать фонды, соответствующие вашим целям и уровню риска',
          services__name5: 'Реализация <br />прав',
          services__text5: 'Наша команда предоставляет поддержку в реализации ваших прав в области страхования и финансов. Мы помогаем защитить ваши интересы и добиться справедливости в сложных ситуациях',
          services__name6: 'Помощь клиентам с страховыми исками',
          services__text6: 'Мы предлагаем полную поддержку при подаче страхового иска, от подготовки документов до взаимодействия со страховыми компаниями. Мы стремимся облегчить процесс и защитить ваши права, чтобы вы получили все полагающиеся выплаты',
        },

        advantages: {
          advantages__title: 'Наши преимущества:',
          advantages__name1: 'Индивидуальный подход к каждому клиенту',
          advantages__text1: 'Мы понимаем, что у каждого человека и бизнеса свои уникальные потребности. Наши специалисты разрабатывают персональные решения, учитывая ваши особенности, цели и жизненные ситуации, что позволяет создать максимально эффективную защиту',
          advantages__name2: 'Профессионализм и надёжность',
          advantages__text2: 'Многолетний опыт и постоянное обучение наших экспертов гарантируют высокий уровень обслуживания. Мы используем современные методы оценки рисков и внедряем инновационные технологии, чтобы обеспечить качественное страхование и защиту ваших активов',
          advantages__name3: 'Прозрачность и оперативное урегулирование убытков',
          advantages__text3: 'Наши процедуры оформлены таким образом, чтобы вы всегда были в курсе каждого этапа работы. Мы стремимся к максимально быстрой и честной выплате компенсаций, минимизируя стресс и время ожидания для наших клиентов',
        }
      },
    }
  }
}
